/**********************************************************************************************/
/*! @file     NextTutorial.cs
*********************************************************************************************
* @brief      次のチュートリアルに進めるかどうかを判断する
*********************************************************************************************
* @author     Yuta Takatsu
*********************************************************************************************
* Copyright © 2017 Yuta Takatsu All Rights Reserved.
**********************************************************************************************/

public class NextTutorial{

    // @brief チュートリアルが終わったかを判断するフラグ
    private bool endFlag = false;

    /// <summary>
    /// @brief フラグの状態を変える関数
    /// </summary>
    public void ChangeFlag()
    {
        endFlag = (!endFlag) ? true : false;
    }

    /// <summary>
    /// @brief フラグの状態を保持する変数のアクセサー
    /// @set   現在の状態を設定
    /// @get   現在の設定を出力
    /// </summary>
    public bool EndTutorial
    {
        set { endFlag = value; }
        get { return endFlag; }
    }
}
